Autodesk.Revit.DB.Structure.RebarConstraint.FlipHandleOverTarget
Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Remarks:
Throw exception if constraint type is not 'ToOtherRebar', or for constraints involving bar/hook bend handle.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToUseClearBarSpacing(System.Boolean)
Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
useClearBarSpacing:
True if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToBindHandleWithTarget(System.Boolean)
Sets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.
bindsHandleWithTarget:
False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetRebar(System.Double)
Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
distanceToTargetRebar:
The distance is given as an offset value, the sign of which depends on the target bar handle direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1